words_to_numbers = {
    'один': 1,
    'одна':1,
    'две':2,
    'два': 2,
    'три': 3,
    'четыре': 4,
    'пять': 5,
    'шесть': 6,
    'семь': 7,
    'восемь': 8,
    'девять': 9,
    'десять': 10,
    'одиннадцать': 11,
    'двенадцать': 12,
    'тринадцать': 13,
    'четырнадцать': 14,
    'пятнадцать': 15,
    'шестнадцать': 16,
    'семнадцать': 17,
    'восемнадцать': 18,
    'девятнадцать': 19,
    'двадцать': 20,
    'тридцать': 30,
    'сорок': 40,
    'пятьдесят': 50,
    'шестьдесят': 60,
    'семьдесят': 70,
    'восемьдесят': 80,
    'девяносто': 90,
    'сто': 100,
    'двести': 200,
    'триста': 300,
    'четыреста': 400,
    'пятсот': 500,
    'шестьсот': 600,
    'семьсот': 700,
    'восемьсот': 800,
    'девятьсот': 900,
}

x = input().split()
number = 0
final_number = 0
print(x)
for i in range(len(x)):
    if (x[i] == 'миллион') or (x[i] == 'миллиона') or (x[i] == 'миллионов'):
        number *= 1000000
        final_number += number
        number = 0

    elif (x[i] == 'тысяча') or (x[i] == 'тысячи') or (x[i] == 'тысяч'):
        number *= 1000
        final_number += number
        number = 0
    else:
        number += words_to_numbers[x[i]]

final_number += number
print(final_number)
